[Description]
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TransactionFailed { get; }
  Visual Basic
Public Shared ReadOnly Property TransactionFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TransactionFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace